04_OpenFoam/_Tut_02/OpenFOAM-14/multiRegion/CHT/vacuumFurnace/system/fluid/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/fluid";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

geometry
{
    rotatingZone
    {
        type cylinder;
        point1 (0 0 0);
        point2 (1 0 0);
        radius 0.2;
    }

    outer
    {
        type cylinder;
        point1 (0 0 0);
        point2 (1 0 0);
        radius 0.51;
    }
}

vertices
(
    (0 0.06 0.06)
    (0 -0.06 0.06)
    (0 -0.06 -0.06)
    (0 0.06 -0.06)
    project (0 0.51 0.51) (outer)
    project (0 -0.51 0.51) (outer)
    project (0 -0.51 -0.51) (outer)
    project (0 0.51 -0.51) (outer)
    (1 0.06 0.06)
    (1 -0.06 0.06)
    (1 -0.06 -0.06)
    (1 0.06 -0.06)
    project (1 0.51 0.51) (outer)
    project (1 -0.51 0.51) (outer)
    project (1 -0.51 -0.51) (outer)
    project (1 0.51 -0.51) (outer)
);

blocks
(
    hex (2 10 11 3 1 9 8 0) (30 5 5) simpleGrading (1 1 1)
    hex (1 9 8 0 5 13 12 4) (30 5 15) simpleGrading (1 1 2)
    hex (0 8 11 3 4 12 15 7) (30 5 15) simpleGrading (1 1 2)
    hex (3 11 10 2 7 15 14 6) (30 5 15) simpleGrading (1 1 2)
    hex (2 10 9 1 6 14 13 5) (30 5 15) simpleGrading (1 1 2)

);

edges
(
    arc 4 5 90 (1 0 0)
    arc 5 6 90 (1 0 0)
    arc 6 7 90 (1 0 0)
    arc 7 4 90 (1 0 0)
    arc 12 13 90 (1 0 0)
    arc 13 14 90 (1 0 0)
    arc 14 15 90 (1 0 0)
    arc 15 12 90 (1 0 0)
);

defaultPatch
{
    name background;
    type internal;
}

// ************************************************************************* //
