04_OpenFoam/_Tut_02/OpenFOAM-14/multiRegion/CHT/vacuumFurnace/system/solid/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/solid";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
    (0.3 -0.1 -0.01)
    (0.7 -0.1 -0.01)
    (0.7 0.1 -0.01)
    (0.3 0.1 -0.01)
    (0.3 -0.1 0.01)
    (0.7 -0.1 0.01)
    (0.7 0.1 0.01)
    (0.3 0.1 0.01)
);


blocks
(
    hex (0 1 2 3 4 5 6 7) (24 12 2) simpleGrading (1 1 1)
);

defaultPatch
{
    name solid;
    type wall;
}

boundary
(
);

// ************************************************************************* //
